# Run with `brew bundle`

# Unix
brew "openssl"
brew "fish"
brew "bash"
brew "bash-completion"
brew "ncdu"
brew "autojump"
brew "stow"
brew "wget"
brew "the_silver_searcher"
brew "aria2"
brew "pandoc"
brew "mpv"

# Developer tools
brew "git"
brew "chruby"
brew "ruby-install"
brew "python"
brew "vim"
brew "ctags"
brew "tmux"
brew "reattach-to-user-namespace"
brew "heroku-toolbelt"
brew "exercism"

# Databases
brew "sqlite"
brew "postgres"
brew "mysql"
brew "redis"

# Applications
cask "adobe-reader"
cask "java"
cask "iterm2"
cask "keepassx"
cask "sublime-text-dev"
cask "dropbox"
cask "flux"
cask "github-desktop"
cask "caffeine"
cask "caret"
cask "spotify"
cask "skype"
cask "vlc"
cask "slack"
cask "firefox"
cask "google-chrome"
cask "wkhtmltopdf"
cask "mactex"
cask "atom"
cask "fritzing"
cask "tunnelblick"
cask "postman" # api tool

# License required
cask "ynab"
cask "adobe-photoshop-lightroom441"
cask "microsoft-office-2011"

# Mac App Store
mas "Evernote", id: 406056744
mas "Xcode", id: 4497799835
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Skitch", id: 425955336
